package com.test.java;

public class Ex26_LocalVariable {

	public static void main(String[] args) {
		// 자바 변수의 종류 
		// 1. 멤버 변수, Member Variable
		//    - 클래스 수업
		// 2. 지역 변수, Local Variable
		//    - 여태 수업하면서 만들었던 변수들 .... 
		//    - 메서드 안에서 선언한 변수
		//    - 변수는 자신이 선언된 메서드 영역을 자신의 영역이라 생각하낟.
		//      Variable Scope(변수 가용 영역) > *** 변수는 자신의 영역을 벗어날 수 없다.
		//
		// 지역 변수의 생명 주기, Life Cycle
		// - 변수가 언제 메모리에 생성되고, 언제 메모리에서 소멸되는지
		// - 메모리를 쓰면 잡고 안쓰면 해제 해야함
		// - 생성 : 변수 선언문이 실행되는 순간  
		// - 자바는 내가 메모리 할당은 내맘대로, 해제는 가비지 컬렉터가 한다. 
		// - 소멸 : 변수 선언문이 포함된 자신의 영역(메소드)에서 제어가 벗어나는 순간.
		// 
	}
	
	

}
